LJY7723/esp32yk/1.ControllerSystem/build/sketch/libraries/RF24/RF24.h
#line 1 "D:\\BaiduSyncdisk\\esp32yk\\yk2\\1.ControllerSystem\\libraries\\RF24\\RF24.h"
/*
 Copyright (C) 2011 J. Coliz <maniacbug@ymail.com>

 This program is free software; you can redistribute it and/or
 modify it under the terms of the GNU General Public License
 version 2 as published by the Free Software Foundation.
 */

/**
 * @file RF24.h
 *
 * Class declaration for RF24 and helper enums
 */

#ifndef RF24_H_
#define RF24_H_

#include "RF24_config.h"

#if defined(RF24_LINUX) || defined(LITTLEWIRE)
    #include "utility/includes.h"
#elif defined SOFTSPI
    #include <DigitalIO.h>
#endif

/**
 * @defgroup PALevel Power Amplifier level
 * Power Amplifier level. The units dBm (decibel-milliwatts or dB<sub>mW</sub>)
 * represents a logarithmic signal loss.
 * @see
 * - RF24::setPALevel()
 * - RF24::getPALevel()
 * @{
 */
typedef enum
{
    /**
     * (0) represents:
     * nRF24L01 | Si24R1 with<br>lnaEnabled = 1 | Si24R1 with<br>lnaEnabled = 0
     * :-------:|:-----------------------------:|:----------------------------:
     *  -18 dBm | -6 dBm | -12 dBm
     */
    RF24_PA_MIN = 0,
    /**
     * (1) represents:
     * nRF24L01 | Si24R1 with<br>lnaEnabled = 1 | Si24R1 with<br>lnaEnabled = 0
     * :-------:|:-----------------------------:|:----------------------------:
     *  -12 dBm | 0 dBm | -4 dBm
     */
    RF24_PA_LOW,
    /**
     * (2) represents:
     * nRF24L01 | Si24R1 with<br>lnaEnabled = 1 | Si24R1 with<br>lnaEnabled = 0
     * :-------:|:-----------------------------:|:----------------------------:
     *  -6 dBm | 3 dBm | 1 dBm
     */
    RF24_PA_HIGH,
    /**
     * (3) represents:
     * nRF24L01 | Si24R1 with<br>lnaEnabled = 1 | Si24R1 with<br>lnaEnabled = 0
     * :-------:|:-----------------------------:|:----------------------------:
     *  0 dBm | 7 dBm | 4 dBm
     */
    RF24_PA_MAX,
    /**
     * (4) This should not be used and remains for backward compatibility.
     */
    RF24_PA_ERROR
} rf24_pa_dbm_e;

/**
 * @}
 * @defgroup Datarate datarate
 * How fast data moves through the air. Units are in bits per second (bps).
 * @see
 * - RF24::setDataRate()
 * - RF24::getDataRate()
 * @{
 */
typedef enum
{
    /** (0) represents 1 Mbps */
    RF24_1MBPS = 0,
    /** (1) represents 2 Mbps */
    RF24_2MBPS,
    /** (2) represents 250 kbps */
    RF24_250KBPS
} rf24_datarate_e;

/**
 * @}
 * @defgroup CRCLength CRC length
 * The length of a CRC checksum that is used (if any). Cyclical Redundancy
 * Checking (CRC) is commonly used to ensure data integrity.
 * @see
 * - RF24::setCRCLength()
 * - RF24::getCRCLength()
 * - RF24::disableCRC()
 * @{
 */
typedef enum
{
    /** (0) represents no CRC checksum is used */
    RF24_CRC_DISABLED = 0,
    /** (1) represents CRC 8 bit checksum is used */
    RF24_CRC_8,
    /** (2) represents CRC 16 bit checksum is used */
    RF24_CRC_16
} rf24_crclength_e;

/**
 * @}
 * @defgroup fifoState FIFO state
 * The state of a single FIFO (RX or TX).
 * Remember, each FIFO has a maximum occupancy of 3 payloads.
 * @see RF24::isFifo()
 * @{
 */
typedef enum
{
    /// @brief The FIFO is not full nor empty, but it is occupied with 1 or 2 payloads.
    RF24_FIFO_OCCUPIED,
    /// @brief The FIFO is empty.
    RF24_FIFO_EMPTY,
    /// @brief The FIFO is full.
    RF24_FIFO_FULL,
    /// @brief Represents corruption of data over SPI (when observed).
    RF24_FIFO_INVALID,
} rf24_fifo_state_e;

/**
 * @}
 * @defgroup StatusFlags Status flags
 * @{
 */

/**
 * @brief An enumeration of constants used to configure @ref StatusFlags
 */
typedef enum
{
#include "nRF24L01.h"
    /// An alias of `0` to describe no IRQ events enabled.
    RF24_IRQ_NONE = 0,
    /// Represents an event where TX Data Failed to send.
    RF24_TX_DF = 1 << MASK_MAX_RT,
    /// Represents an event where TX Data Sent successfully.
    RF24_TX_DS = 1 << TX_DS,
    /// Represents an event where RX Data is Ready to `RF24::read()`.
    RF24_RX_DR = 1 << RX_DR,
    /// Equivalent to `RF24_RX_DR | RF24_TX_DS | RF24_TX_DF`.
    RF24_IRQ_ALL = (1 << MASK_MAX_RT) | (1 << TX_DS) | (1 << RX_DR),
} rf24_irq_flags_e;

/**
 * @}
 * @brief Driver class for nRF24L01(+) 2.4GHz Wireless Transceiver
 */
class RF24
{
private:
#ifdef SOFTSPI
    SoftSPI<SOFT_SPI_MISO_PIN, SOFT_SPI_MOSI_PIN, SOFT_SPI_SCK_PIN, SPI_MODE> spi;
#elif defined(SPI_UART)
    SPIUARTClass uspi;
#endif

#if defined(RF24_LINUX) || defined(XMEGA_D3) /* XMEGA can use SPI class */
    SPI spi;
#endif // defined (RF24_LINUX) || defined (XMEGA_D3)
#if defined(RF24_SPI_PTR)
    _SPI* _spi;
#endif // defined (RF24_SPI_PTR)

    rf24_gpio_pin_t ce_pin;  /* "Chip Enable" pin, activates the RX or TX role */
    rf24_gpio_pin_t csn_pin; /* SPI Chip select */
    uint32_t spi_speed;      /* SPI Bus Speed */
#if defined(RF24_LINUX) || defined(XMEGA_D3) || defined(RF24_RP2)
    uint8_t spi_rxbuff[32 + 1]; //SPI receive buffer (payload max 32 bytes)
    uint8_t spi_txbuff[32 + 1]; //SPI transmit buffer (payload max 32 bytes + 1 byte for the command)
#endif
    uint8_t status;                   /* The status byte returned from every SPI transaction */
    uint8_t payload_size;             /* Fixed size of payloads */
    uint8_t pipe0_reading_address[5]; /* Last address set on pipe 0 for reading. */
    uint8_t pipe0_writing_address[5]; /* Last address set on pipe 0 for writing. */
    uint8_t config_reg;               /* For storing the value of the NRF_CONFIG register */
    bool _is_p_variant;               /* For storing the result of testing the toggleFeatures() affect */
    bool _is_p0_rx;                   /* For keeping track of pipe 0's usage in user-triggered RX mode. */

protected:
    /**
     * SPI transactions
     *
     * Common code for SPI transactions including CSN toggle
     *
     */
    inline void beginTransaction();

    inline void endTransaction();

    /** Whether ack payloads are enabled. */
    bool ack_payloads_enabled;
    /** The address width to use (3, 4 or 5 bytes). */
    uint8_t addr_width;
    /** Whether dynamic payloads are enabled. */
    bool dynamic_payloads_enabled;

    /**
     * Read a chunk of data in from a register
     *
     * @param reg Which register. Use constants from nRF24L01.h
     * @param[out] buf Where to put the data
     * @param len How many bytes of data to transfer
     * @note This returns nothing. Older versions of this function returned the status
     * byte, but that it now saved to a private member on all SPI transactions.
     */
    void read_register(uint8_t reg, uint8_t* buf, uint8_t len);

    /**
     * Read single byte from a register
     *
     * @param reg Which register. Use constants from nRF24L01.h
     * @return Current value of register @p reg
     */
    uint8_t read_register(uint8_t reg);

