LJY7723/esp32yk/1.ControllerSystem/build/sketch/libraries/RF24/RF24.h
public:
    /**
     * @name Primary public interface
     *
     *  These are the main methods you need to operate the chip
     */
    /**@{*/

    /**
     * RF24 Constructor
     *
     * Creates a new instance of this driver.  Before using, you create an instance
     * and send in the unique pins that this chip is connected to.
     *
     * See [Related Pages](pages.html) for device specific information
     *
     * @param _cepin The pin attached to Chip Enable on the RF module.
     * Review our [Linux general](rpi_general.md) doc for details about selecting pin numbers on Linux systems.
     * @param _cspin The pin attached to Chip Select (often labeled CSN) on the radio module.
     * - For the Arduino Due board, the [Arduino Due extended SPI feature](https://www.arduino.cc/en/Reference/DueExtendedSPI)
     * is not supported. This means that the Due's pins 4, 10, or 52 are not mandated options (can use any digital output pin) for
     * the radio's CSN pin.
     * @param _spi_speed The SPI speed in Hz ie: 1000000 == 1Mhz
     * - Users can specify default SPI speed by modifying @ref RF24_SPI_SPEED in @ref RF24_config.h
     *     - For Arduino, the default SPI speed will only be properly configured this way on devices supporting SPI TRANSACTIONS
     *     - Older/Unsupported Arduino devices will use a default clock divider & settings configuration
     *     - For Linux: The old way of setting SPI speeds using BCM2835 driver enums has been removed as of v1.3.7
     */
    RF24(rf24_gpio_pin_t _cepin, rf24_gpio_pin_t _cspin, uint32_t _spi_speed = RF24_SPI_SPEED);

    /**
     * A constructor for initializing the radio's hardware dynamically
     * @warning You MUST use begin(rf24_gpio_pin_t, rf24_gpio_pin_t) or begin(_SPI*, rf24_gpio_pin_t, rf24_gpio_pin_t) to pass both the
     * digital output pin numbers connected to the radio's CE and CSN pins.
     * @param _spi_speed The SPI speed in Hz ie: 1000000 == 1Mhz
     * - Users can specify default SPI speed by modifying @ref RF24_SPI_SPEED in @ref RF24_config.h
     *     - For Arduino, the default SPI speed will only be properly configured this way on devices supporting SPI TRANSACTIONS
     *     - Older/Unsupported Arduino devices will use a default clock divider & settings configuration
     *     - For Linux: The old way of setting SPI speeds using BCM2835 driver enums has been removed as of v1.3.7
     */
    RF24(uint32_t _spi_speed = RF24_SPI_SPEED);

#if defined(RF24_LINUX)
    virtual ~RF24() {};
#endif

    /**
     * Begin operation of the chip
     *
     * Call this in setup(), before calling any other methods.
     * @code
     * if (!radio.begin()) {
     *   Serial.println(F("radio hardware not responding!"));
     *   while (1) {} // hold program in infinite loop to prevent subsequent errors
     * }
     * @endcode
     * @return
     * - `true` if the radio was successfully initialized
     * - `false` if the MCU failed to communicate with the radio hardware
     */
    bool begin(void);

#if defined(RF24_SPI_PTR) || defined(DOXYGEN_FORCED)
    /**
     * Same as begin(), but allows specifying a non-default SPI bus to use.
     *
     * @note This function assumes the `SPI::begin()` method was called before to
     * calling this function.
     *
     * @warning This function is for the Arduino platforms only
     *
     * @param spiBus A pointer or reference to an instantiated SPI bus object.
     * The `_SPI` datatype is a "wrapped" definition that will represent
     * various SPI implementations based on the specified platform.
     * @see Review the [Arduino support page](arduino.md).
     *
     * @return same result as begin()
     */
    bool begin(_SPI* spiBus);

    /**
     * Same as begin(), but allows dynamically specifying a SPI bus, CE pin,
     * and CSN pin to use.
     *
     * @note This function assumes the `SPI::begin()` method was called before to
     * calling this function.
     *
     * @warning This function is for the Arduino platforms only
     *
     * @param spiBus A pointer or reference to an instantiated SPI bus object.
     * The `_SPI` datatype is a "wrapped" definition that will represent
     * various SPI implementations based on the specified platform.
     * @param _cepin The pin attached to Chip Enable on the RF module.
     * Review our [Linux general](rpi_general.md) doc for details about selecting pin numbers on Linux systems.
     * @param _cspin The pin attached to Chip Select (often labeled CSN) on the radio module.
     * - For the Arduino Due board, the [Arduino Due extended SPI feature](https://www.arduino.cc/en/Reference/DueExtendedSPI)
     * is not supported. This means that the Due's pins 4, 10, or 52 are not mandated options (can use any digital output pin) for the radio's CSN pin.
     *
     * @see Review the [Arduino support page](arduino.md).
     *
     * @return same result as begin()
     */
    bool begin(_SPI* spiBus, rf24_gpio_pin_t _cepin, rf24_gpio_pin_t _cspin);
#endif // defined (RF24_SPI_PTR) || defined (DOXYGEN_FORCED)

    /**
     * Same as begin(), but allows dynamically specifying a CE pin
     * and CSN pin to use.
     * @param _cepin The pin attached to Chip Enable on the RF module
     * @param _cspin The pin attached to Chip Select (often labeled CSN) on the radio module.
     * - For the Arduino Due board, the [Arduino Due extended SPI feature](https://www.arduino.cc/en/Reference/DueExtendedSPI)
     * is not supported. This means that the Due's pins 4, 10, or 52 are not mandated options (can use any digital output pin) for the radio's CSN pin.
     * @return same result as begin()
     */
    bool begin(rf24_gpio_pin_t _cepin, rf24_gpio_pin_t _cspin);

    /**
     * Checks if the chip is connected to the SPI bus
     */
    bool isChipConnected();

    /**
     * Start listening on the pipes opened for reading.
     *
     * 1. Be sure to call openReadingPipe() first.
     * 2. Do not call write() while in this mode, without first calling stopListening().
     * 3. Call available() to check for incoming traffic, and read() to get it.
     *
     * Open reading pipe 1 using address `0xCCCECCCECC`
     * @code
     * byte address[] = {0xCC, 0xCE, 0xCC, 0xCE, 0xCC};
     * radio.openReadingPipe(1,address);
     * radio.startListening();
     * @endcode
     *
     * @note If there was a call to openReadingPipe() about pipe 0 prior to
     * calling this function, then this function will re-write the address
     * that was last set to reading pipe 0. This is because openWritingPipe()
     * will overwrite the address to reading pipe 0 for proper auto-ack
     * functionality.
     */
    void startListening(void);

    /**
     * Stop listening for incoming messages, and switch to transmit mode.
     *
     * Do this before calling write().
     * @code
     * radio.stopListening();
     * radio.write(&data, sizeof(data));
     * @endcode
     *
     * @warning When the ACK payloads feature is enabled, the TX FIFO buffers are
     * flushed when calling this function. This is meant to discard any ACK
     * payloads that were not appended to acknowledgment packets.
     */
    void stopListening(void);

    /**
     * @brief Similar to startListening(void) but changes the TX address.
     * @param txAddress The new TX address.
     * This value will be cached for auto-ack purposes.
     */
    void stopListening(const uint8_t* txAddress);

    /**
     * Check whether there are bytes available to be read
     * @code
     * if(radio.available()){
     *   radio.read(&data,sizeof(data));
     * }
     * @endcode
     *
     * @see available(uint8_t*)
     *
     * @return True if there is a payload available, false if none is
     *
     * @warning This function relies on the information about the pipe number
     * that received the next available payload. According to the datasheet,
     * the data about the pipe number that received the next available payload
     * is "unreliable" during a FALLING transition on the IRQ pin. This means
     * you should call clearStatusFlags() before calling this function
     * during an ISR (Interrupt Service Routine). For example:
     * @code
     * void isrCallbackFunction() {
     *   bool tx_ds, tx_df, rx_dr;
     *   uint8_t flags = radio.clearStatusFlags(); // resets the IRQ pin to HIGH
     *   radio.available();                        // returned data should now be reliable
     * }
     *
     * void setup() {
     *   pinMode(IRQ_PIN, INPUT);
     *   attachInterrupt(digitalPinToInterrupt(IRQ_PIN), isrCallbackFunction, FALLING);
     * }
     * @endcode
     */
    bool available(void);

    /**
     * Read payload data from the RX FIFO buffer(s).
     *
     * The length of data read is usually the next available payload's length
     * @see
     * - getPayloadSize()
     * - getDynamicPayloadSize()
     *
     * @note I specifically chose `void*` as a data type to make it easier
     * for beginners to use.  No casting needed.
     *
     * @param buf Pointer to a buffer where the data should be written
     * @param len Maximum number of bytes to read into the buffer. This
     * value should match the length of the object referenced using the
     * `buf` parameter. The absolute maximum number of bytes that can be read
     * in one call is 32 (for dynamic payload lengths) or whatever number was
     * previously passed to setPayloadSize() (for static payload lengths).
     * @remark
     * @parblock
     * Remember that each call to read() fetches data from the
     * RX FIFO beginning with the first byte from the first available
     * payload. A payload is not removed from the RX FIFO until it's
     * entire length (or more) is fetched using read().
     *
     * - If `len` parameter's value is less than the available payload's
     *   length, then the payload remains in the RX FIFO.
     * - If `len` parameter's value is greater than the first of multiple
     *   available payloads, then the data saved to the `buf`
     *   parameter's object will be supplemented with data from the next
     *   available payload.
     * - If `len` parameter's value is greater than the last available
     *   payload's length, then the last byte in the payload is used as
     *   padding for the data saved to the `buf` parameter's object.
     *   The nRF24L01 will repeatedly use the last byte from the last
     *   payload even when read() is called with an empty RX FIFO.
     * @endparblock
     * @note To use this function in the python wrapper, remember that
     * only the `len` parameter is required because this function (in the
     * python wrapper) returns the payload data as a buffer protocol object
     * (bytearray object).
     * @code{.py}
     * # let `radio` be the instantiated RF24 object
     * if radio.available():
     *     length = radio.getDynamicPayloadSize()  # or radio.getPayloadSize() for static payload sizes
     *     received_payload = radio.read(length)
     * @endcode
     *
     * @note This function no longer returns a boolean. Use available to
     * determine if packets are available. The `RX_DR` Interrupt flag is now
     * cleared with this function instead of when calling available().
     * @code
     * if(radio.available()) {
     *   radio.read(&data, sizeof(data));
     * }
     * @endcode
     */
    void read(void* buf, uint8_t len);

    /**
     * Be sure to call openWritingPipe() first to set the destination
     * of where to write to.
     *
     * This blocks until the message is successfully acknowledged by
     * the receiver or the timeout/retransmit maxima are reached.  In
     * the current configuration, the max delay here is 60-70ms.
     *
     * The maximum size of data written is the fixed payload size, see
     * getPayloadSize().  However, you can write less, and the remainder
     * will just be filled with zeroes.
     *
     * TX/RX/RT interrupt flags will be cleared every time write is called
     *
     * @param buf Pointer to the data to be sent
     * @param len Number of bytes to be sent
     *
     * @code
     * radio.stopListening();
     * radio.write(&data,sizeof(data));
     * @endcode
     *
     * @note The `len` parameter must be omitted when using the python
     * wrapper because the length of the payload is determined automatically.
     * To use this function in the python wrapper:
     * @code{.py}
     * # let `radio` be the instantiated RF24 object
     * buffer = b"Hello World"  # a `bytes` object
     * radio.write(buffer)
     * @endcode
     *
     * @return
     * - `true` if the payload was delivered successfully and an acknowledgement
     *   (ACK packet) was received. If auto-ack is disabled, then any attempt
     *   to transmit will also return true (even if the payload was not
     *   received).
     * - `false` if the payload was sent but was not acknowledged with an ACK
     *   packet. This condition can only be reported if the auto-ack feature
     *   is on.
     */
    bool write(const void* buf, uint8_t len);

    /**
     * New: Open a pipe for writing via byte array. Old addressing format retained
     * for compatibility.
     *
     * @deprecated Use `RF24::stopListening(uint8_t*)` instead.
     *
     * Only one writing pipe can be opened at once, but this function changes
     * the address that is used to transmit (ACK payloads/packets do not apply
     * here). Be sure to call stopListening() prior to calling this function.
     *
     * Addresses are assigned via a byte array, default is 5 byte address length
     *
     * @code
     * uint8_t addresses[][6] = {"1Node", "2Node"};
     * radio.openWritingPipe(addresses[0]);
     * @endcode
     * @code
     * uint8_t address[] = { 0xCC, 0xCE, 0xCC, 0xCE, 0xCC };
     * radio.openWritingPipe(address);
     * address[0] = 0x33;
     * radio.openReadingPipe(1, address);
     * @endcode
     *
     * @warning This function will overwrite the address set to reading pipe 0
     * as stipulated by the datasheet for proper auto-ack functionality in TX
     * mode. Use this function to ensure proper transmission acknowledgement
     * when the address set to reading pipe 0 (via openReadingPipe()) does not
     * match the address passed to this function. If the auto-ack feature is
     * disabled, then this function will still overwrite the address for
     * reading pipe 0 regardless.
     *
     * @see
     * - setAddressWidth()
     * - startListening()
     * - stopListening()
     *
     * @param address The address to be used for outgoing transmissions (uses
     * pipe 0). Coordinate this address amongst other receiving nodes (the
     * pipe numbers don't need to match). This address is cached to ensure proper
     * auto-ack behavior; stopListening() will always restore the latest cached TX
     * address.
     *
     * @remark There is no address length parameter because this function will
     * always write the number of bytes that the radio addresses are configured
     * to use (set with setAddressWidth()).
     */

    void openWritingPipe(const uint8_t* address);

    /**
     * Open a pipe for reading
     *
     * Up to 6 pipes can be open for reading at once.  Open all the required
     * reading pipes, and then call startListening().
     *
     * @see
     * - openWritingPipe()
     * - setAddressWidth()
     *
     * @note Pipes 0 and 1 will store a full 5-byte address. Pipes 2-5 will technically
     * only store a single byte, borrowing up to 4 additional bytes from pipe 1 per the
     * assigned address width.
     * Pipes 1-5 should share the same address, except the first byte.
     * Only the first byte in the array should be unique, e.g.
     * @code
     * uint8_t addresses[][6] = {"Prime", "2Node", "3xxxx", "4xxxx"};
     * openReadingPipe(0, addresses[0]); // address used is "Prime"
     * openReadingPipe(1, addresses[1]); // address used is "2Node"
     * openReadingPipe(2, addresses[2]); // address used is "3Node"
     * openReadingPipe(3, addresses[3]); // address used is "4Node"
     * @endcode
     *
     * @warning
     * @parblock
     * If the reading pipe 0 is opened by this function, the address
     * passed to this function (for pipe 0) will be restored at every call to
     * startListening().
     *
     * Read
     * http://maniacalbits.blogspot.com/2013/04/rf24-addressing-nrf24l01-radios-require.html
     * to understand how to avoid using malformed addresses. This address
     * restoration is implemented because of the underlying necessary
     * functionality of openWritingPipe().
     * @endparblock
     *
     * @param number Which pipe to open. Only pipe numbers 0-5 are available,
     * an address assigned to any pipe number not in that range will be ignored.
     * @param address The 24, 32 or 40 bit address of the pipe to open.
     *
     * There is no address length parameter because this function will
     * always write the number of bytes (for pipes 0 and 1) that the radio
     * addresses are configured to use (set with setAddressWidth()).
     */
    void openReadingPipe(uint8_t number, const uint8_t* address);

    /**@}*/
    /**
     * @name Advanced Operation
     *
     * Methods you can use to drive the chip in more advanced ways
     */
    /**@{*/

    /**
     * Set radio's CE (Chip Enable) pin state.
     *
     * @warning Please see the datasheet for a much more detailed description of this pin.
     *
     * @note This is only publicly exposed for advanced use cases such as complex networking or
     * streaming consecutive payloads without robust error handling.
     * Typical uses are satisfied by simply using `startListening()` for RX mode or
     * `stopListening()` and `write()` for TX mode.
     *
     * @param level In RX mode, `HIGH` causes the radio to begin actively listening.
     * In TX mode, `HIGH` (+ 130 microsecond delay) causes the radio to begin transmitting.
     * Setting this to `LOW` will cause the radio to stop transmitting or receiving in any mode.
     */
    void ce(bool level);

    /**
     * Print a giant block of debugging information to stdout
     *
     * @warning Does nothing if stdout is not defined.  See fdevopen in stdio.h
     * The printf.h file is included with the library for Arduino.
     * @code
     * #include <printf.h>
     * setup() {
     *   Serial.begin(115200);
     *   printf_begin();
     *   // ...
     * }
     * @endcode
     */
    void printDetails(void);

    /**
     * Decode and print the given STATUS byte to stdout.
     *
     * @param flags The STATUS byte to print.
     * This value is fetched with update() or getStatusFlags().
     *
     * @warning Does nothing if stdout is not defined.  See fdevopen in stdio.h
     */
    void printStatus(uint8_t flags);

    /**
     * Print a giant block of debugging information to stdout. This function
     * differs from printDetails() because it makes the information more
     * understandable without having to look up the datasheet or convert
     * hexadecimal to binary. Only use this function if your application can
     * spare extra bytes of memory.
     *
     * @warning Does nothing if stdout is not defined.  See fdevopen in stdio.h
     * The printf.h file is included with the library for Arduino.
     * @code
     * #include <printf.h>
     * setup() {
     *   Serial.begin(115200);
     *   printf_begin();
     *   // ...
     * }
     * @endcode
     *
     * @note If the automatic acknowledgements feature is configured differently
     * for each pipe, then a binary representation is used in which bits 0-5
     * represent pipes 0-5 respectively. A `0` means the feature is disabled, and
     * a `1` means the feature is enabled.
     */
    void printPrettyDetails(void);

    /**
     * Put a giant block of debugging information in a char array. This function
     * differs from printPrettyDetails() because it uses `sprintf()` and does not use
     * a predefined output stream (like `Serial` or stdout). Only use this function if
     * your application can spare extra bytes of memory. This can also be used for boards that
     * do not support `printf()` (which is required for printDetails() and printPrettyDetails()).
     *
     * @remark
     * The C standard function [sprintf()](http://www.cplusplus.com/reference/cstdio/sprintf)
     * formats a C-string in the exact same way as `printf()` but outputs (by reference)
     * into a char array. The formatted string literal for sprintf() is stored
     * in nonvolatile program memory.
     *
     * @warning Use a buffer of sufficient size for the `debugging_information`. Start
     * with a char array that has at least 870 elements. There is no overflow protection when using
     * sprintf(), so the output buffer must be sized correctly or the resulting behavior will
     * be undefined.
     * @code
     * char buffer[870] = {'\0'};
     * uint16_t used_chars = radio.sprintfPrettyDetails(buffer);
     * Serial.println(buffer);
     * Serial.print(F("strlen = "));
     * Serial.println(used_chars + 1); // +1 for c-strings' null terminating byte
     * @endcode
     *
     * @param debugging_information The c-string buffer that the debugging
     * information is stored to. This must be allocated to a minimum of 870 bytes of memory.
     * @returns The number of characters altered in the given buffer. Remember that,
     * like `sprintf()`, this returned number does not include the null terminating byte.
     *
     * This function is available in the python wrapper, but it accepts no parameters and
     * returns a string. It does not return the number of characters in the string.
     * @code{.py}
     * debug_info = radio.sprintfPrettyDetails()
     * print(debug_info)
     * print("str_len =", len(debug_info))
     * @endcode
     *
     * @note If the automatic acknowledgements feature is configured differently
     * for each pipe, then a binary representation is used in which bits 0-5
     * represent pipes 0-5 respectively. A `0` means the feature is disabled, and
     * a `1` means the feature is enabled.
     */
    uint16_t sprintfPrettyDetails(char* debugging_information);

