LJY7723/esp32yk/1.ControllerSystem/build/sketch/libraries/RF24/RF24.h
    /**
     * Encode radio debugging information into an array of uint8_t. This function
     * differs from other debug output methods because the debug information can
     * be decoded by an external program.
     *
     * This function is not available in the python wrapper because it is intended for
     * use on processors with very limited available resources.
     *
     * @remark
     * This function uses much less ram than other `*print*Details()` methods.
     *
     * @code
     * uint8_t encoded_details[43] = {0};
     * radio.encodeRadioDetails(encoded_details);
     * @endcode
     *
     * @param encoded_status The uint8_t array that RF24 radio details are
     * encoded into. This array must be at least 43 bytes in length; any less would surely
     * cause undefined behavior.
     *
     * Registers names and/or data corresponding to the index of the `encoded_details` array:
     * | index | register/data |
     * |------:|:--------------|
     * | 0 |     NRF_CONFIG |
     * | 1 |     EN_AA |
     * | 2 |     EN_RXADDR |
     * | 3 |     SETUP_AW |
     * | 4 |     SETUP_RETR |
     * | 5 |     RF_CH |
     * | 6 |     RF_SETUP |
     * | 7 |     NRF_STATUS |
     * | 8 |     OBSERVE_TX |
     * | 9 |     CD (aka RPD) |
     * | 10-14 | RX_ADDR_P0 |
     * | 15-19 | RX_ADDR_P1 |
     * | 20 |    RX_ADDR_P2 |
     * | 21 |    RX_ADDR_P3 |
     * | 22 |    RX_ADDR_P4 |
     * | 23 |    RX_ADDR_P5 |
     * | 24-28 | TX_ADDR |
     * | 29 |    RX_PW_P0 |
     * | 30 |    RX_PW_P1 |
     * | 31 |    RX_PW_P2 |
     * | 32 |    RX_PW_P3 |
     * | 33 |    RX_PW_P4 |
     * | 34 |    RX_PW_P5 |
     * | 35 |    FIFO_STATUS |
     * | 36 |    DYNPD |
     * | 37 |    FEATURE |
     * | 38-39 | ce_pin |
     * | 40-41 | csn_pin |
     * | 42 |    SPI speed (in MHz) or'd with (isPlusVariant << 4) |
     */
    void encodeRadioDetails(uint8_t* encoded_status);

    /**
     * Test whether there are bytes available to be read from the
     * FIFO buffers.
     *
     * @note This function is named `available_pipe()` in the python wrapper.
     * @parblock
     * Additionally, the `available_pipe()` function (which
     * takes no arguments) returns a 2 item tuple containing (ordered by
     * tuple's indices):
     * - A boolean describing if there is a payload available to read from
     *   the RX FIFO buffers.
     * - The pipe number that received the next available payload in the RX
     *   FIFO buffers. If the item at the tuple's index 0 is `False`, then
     *   this pipe number is invalid.
     *
     * To use this function in python:
     * @code{.py}
     * # let `radio` be the instantiated RF24 object
     * has_payload, pipe_number = radio.available_pipe()  # expand the tuple to 2 variables
     * if has_payload:
     *     print("Received a payload with pipe", pipe_number)
     * @endcode
     * @endparblock
     *
     * @param[out] pipe_num Which pipe has the payload available
     * @code
     * uint8_t pipeNum;
     * if(radio.available(&pipeNum)){
     *   radio.read(&data, sizeof(data));
     *   Serial.print("Received data on pipe ");
     *   Serial.println(pipeNum);
     * }
     * @endcode
     *
     * @warning According to the datasheet, the data saved to `pipe_num` is
     * "unreliable" during a FALLING transition on the IRQ pin. This means you
     * should call clearStatusFlags() before calling this function during
     * an ISR (Interrupt Service Routine). For example:
     * @code
     * void isrCallbackFunction() {
     *   radio.clearStatusFlags(); // resets the IRQ pin to inactive HIGH
     *   uint8_t pipe = 7;         // initialize pipe data
     *   radio.available(&pipe);   // pipe data should now be reliable
     * }
     *
     * void setup() {
     *   pinMode(IRQ_PIN, INPUT);
     *   attachInterrupt(digitalPinToInterrupt(IRQ_PIN), isrCallbackFunction, FALLING);
     * }
     * @endcode
     *
     * @return
     * - `true` if there is a payload available in the top (first out)
     *   level RX FIFO.
     * - `false` if there is nothing available in the RX FIFO because it is
     *   empty.
     */
    bool available(uint8_t* pipe_num);

    /**
     * Use this function to check if the radio's RX FIFO levels are all
     * occupied. This can be used to prevent data loss because any incoming
     * transmissions are rejected if there is no unoccupied levels in the RX
     * FIFO to store the incoming payload. Remember that each level can hold
     * up to a maximum of 32 bytes.
     * @return
     * - `true` if all three 3 levels of the RX FIFO buffers are occupied.
     * - `false` if there is one or more levels available in the RX FIFO
     *   buffers. Remember that this does not always mean that the RX FIFO
     *   buffers are empty; use available() to see if the RX FIFO buffers are
     *   empty or not.
     */
    bool rxFifoFull();

    /**
     * @param about_tx `true` focuses on the TX FIFO, `false` focuses on the RX FIFO
     * @return
     * - @ref RF24_FIFO_OCCUPIED (`0`) if the specified FIFO is neither full nor empty.
     * - @ref RF24_FIFO_EMPTY (`1`) if the specified FIFO is empty.
     * - @ref RF24_FIFO_FULL (`2`) if the specified FIFO is full.
     * - @ref RF24_FIFO_INVALID (`3`) if the data fetched over SPI was malformed.
     */
    rf24_fifo_state_e isFifo(bool about_tx);

    /**
     * @deprecated Use RF24::isFifo(bool about_tx) instead.
     * See our [migration guide](migration.md) to understand what you should update in your code.
     *
     * @param about_tx `true` focuses on the TX FIFO, `false` focuses on the RX FIFO
     * @param check_empty
     * - `true` checks if the specified FIFO is empty
     * - `false` checks is the specified FIFO is full.
     * @return A boolean answer to the question "is the [TX/RX] FIFO [empty/full]?"
     */
    bool isFifo(bool about_tx, bool check_empty);

    /**
     * Enter low-power mode
     *
     * To return to normal power mode, call powerUp().
     *
     * @note After calling startListening(), a basic radio will consume about 13.5mA
     * at max PA level.
     * During active transmission, the radio will consume about 11.5mA, but this will
     * be reduced to 26uA (.026mA) between sending.
     * In full powerDown mode, the radio will consume approximately 900nA (.0009mA)
     *
     * @code
     * radio.powerDown();
     * avr_enter_sleep_mode(); // Custom function to sleep the device
     * radio.powerUp();
     * @endcode
     */
    void powerDown(void);

    /**
     * Leave low-power mode - required for normal radio operation after calling powerDown()
     *
     * To return to low power mode, call powerDown().
     * @note This will take up to 5ms for maximum compatibility
     */
    void powerUp(void);

    /**
     * Write for single NOACK writes. Optionally disable
     * acknowledgements/auto-retries for a single payload using the
     * multicast parameter set to true.
     *
     * Can be used with enableAckPayload() to request a response
     * @see
     * - setAutoAck()
     * - write()
     *
     * @param buf Pointer to the data to be sent
     * @param len Number of bytes to be sent
     * @param multicast Request ACK response (false), or no ACK response
     * (true). Be sure to have called enableDynamicAck() at least once before
     * setting this parameter.
     * @return
     * - `true` if the payload was delivered successfully and an acknowledgement
     *   (ACK packet) was received. If auto-ack is disabled, then any attempt
     *   to transmit will also return true (even if the payload was not
     *   received).
     * - `false` if the payload was sent but was not acknowledged with an ACK
     *   packet. This condition can only be reported if the auto-ack feature
     *   is on.
     *
     * @note The `len` parameter must be omitted when using the python
     * wrapper because the length of the payload is determined automatically.
     * To use this function in the python wrapper:
     * @code{.py}
     * # let `radio` be the instantiated RF24 object
     * buffer = b"Hello World"  # a `bytes` object
     * radio.write(buffer, False)  # False = the multicast parameter
     * @endcode
     */
    bool write(const void* buf, uint8_t len, const bool multicast);

    /**
     * This will not block until the 3 FIFO buffers are filled with data.
     * Once the FIFOs are full, writeFast() will simply wait for a buffer to
     * become available or a transmission failure (returning `true` or `false`
     * respectively).
     *
     * @warning
     * @parblock
     * It is important to never keep the nRF24L01 in TX mode and FIFO full for more than 4ms at a time. If the auto
     * retransmit is enabled, the nRF24L01 is never in TX mode long enough to disobey this rule. Allow the FIFO
     * to clear by issuing txStandBy() or ensure appropriate time between transmissions.
     *
     * Use txStandBy() when this function returns `false`.
     *
     * Example (Partial blocking):
     * @code
     * radio.writeFast(&buf,32);  // Writes 1 payload to the buffers
     * txStandBy();     		   // Returns 0 if failed. 1 if success. Blocks only until MAX_RT timeout or success. Data flushed on fail.
     *
     * radio.writeFast(&buf,32);  // Writes 1 payload to the buffers
     * txStandBy(1000);		   // Using extended timeouts, returns 1 if success. Retries failed payloads for 1 seconds before returning 0.
     * @endcode
     * @endparblock
     *
     * @see
     * - setAutoAck()
     * - txStandBy()
     * - write()
     * - writeBlocking()
     *
     * @param buf Pointer to the data to be sent
     * @param len Number of bytes to be sent
     * @return
     * - `true` if the payload passed to `buf` was loaded in the TX FIFO.
     * - `false` if the payload passed to `buf` was not loaded in the TX FIFO
     *   because a previous payload already in the TX FIFO failed to
     *   transmit. This condition can only be reported if the auto-ack feature
     *   is on.
     *
     * @note The `len` parameter must be omitted when using the python
     * wrapper because the length of the payload is determined automatically.
     * To use this function in the python wrapper:
     * @code{.py}
     * # let `radio` be the instantiated RF24 object
     * buffer = b"Hello World"  # a `bytes` object
     * radio.writeFast(buffer)
     * @endcode
     */
    bool writeFast(const void* buf, uint8_t len);

    /**
     * Similar to writeFast(const void*, uint8_t) but allows for single NOACK writes.
     * Optionally disable acknowledgements/auto-retries for a single payload using the
     * multicast parameter set to `true`.
     *
     * @warning If the auto-ack feature is enabled, then it is strongly encouraged to call
     * txStandBy() when this function returns `false`.
     *
     * @see
     * - setAutoAck()
     * - txStandBy()
     * - write()
     * - writeBlocking()
     *
     * @param buf Pointer to the data to be sent
     * @param len Number of bytes to be sent
     * @param multicast Request ACK response (false), or no ACK response
     * (true). Be sure to have called enableDynamicAck() at least once before
     * setting this parameter.
     * @return
     * - `true` if the payload passed to `buf` was loaded in the TX FIFO.
     * - `false` if the payload passed to `buf` was not loaded in the TX FIFO
     *   because a previous payload already in the TX FIFO failed to
     *   transmit. This condition can only be reported if the auto-ack feature
     *   is on (and the multicast parameter is set to false).
     *
     * @note The `len` parameter must be omitted when using the python
     * wrapper because the length of the payload is determined automatically.
     * To use this function in the python wrapper:
     * @code{.py}
     * # let `radio` be the instantiated RF24 object
     * buffer = b"Hello World"  # a `bytes` object
     * radio.writeFast(buffer, False)  # False = the multicast parameter
     * @endcode
     */
    bool writeFast(const void* buf, uint8_t len, const bool multicast);

    /**
     * This function extends the auto-retry mechanism to any specified duration.
     * It will not block until the 3 FIFO buffers are filled with data.
     * If so the library will auto retry until a new payload is written
     * or the user specified timeout period is reached.
     * @warning It is important to never keep the nRF24L01 in TX mode and FIFO full for more than 4ms at a time. If the auto
     * retransmit is enabled, the nRF24L01 is never in TX mode long enough to disobey this rule. Allow the FIFO
     * to clear by issuing txStandBy() or ensure appropriate time between transmissions.
     *
     * Example (Full blocking):
     * @code
     * radio.writeBlocking(&buf, sizeof(buf), 1000); // Wait up to 1 second to write 1 payload to the buffers
     * radio.txStandBy(1000);                        // Wait up to 1 second for the payload to send. Return 1 if ok, 0 if failed.
     *                                               // Blocks only until user timeout or success. Data flushed on fail.
     * @endcode
     * @note If used from within an interrupt, the interrupt should be disabled until completion, and sei(); called to enable millis().
     * @see
     * - txStandBy()
     * - write()
     * - writeFast()
     *
     * @param buf Pointer to the data to be sent
     * @param len Number of bytes to be sent
     * @param timeout User defined timeout in milliseconds.
     *
     * @note The `len` parameter must be omitted when using the python
     * wrapper because the length of the payload is determined automatically.
     * To use this function in the python wrapper:
     * @code{.py}
     * # let `radio` be the instantiated RF24 object
     * buffer = b"Hello World"  # a `bytes` object
     * radio.writeBlocking(buffer, 1000)  # 1000 means wait at most 1 second
     * @endcode
     *
     * @return
     * - `true` if the payload passed to `buf` was loaded in the TX FIFO.
     * - `false` if the payload passed to `buf` was not loaded in the TX FIFO
     *   because a previous payload already in the TX FIFO failed to
     *   transmit. This condition can only be reported if the auto-ack feature
     *   is on.
     */
    bool writeBlocking(const void* buf, uint8_t len, uint32_t timeout);

    /**
     * This function should be called as soon as transmission is finished to
     * drop the radio back to STANDBY-I mode. If not issued, the radio will
     * remain in STANDBY-II mode which, per the data sheet, is not a recommended
     * operating mode.
     *
     * @note When transmitting data in rapid succession, it is still recommended by
     * the manufacturer to drop the radio out of TX or STANDBY-II mode if there is
     * time enough between sends for the FIFOs to empty. This is not required if auto-ack
     * is enabled.
     *
     * Relies on built-in auto retry functionality.
     *
     * Example (Partial blocking):
     * @code
     * radio.writeFast(&buf, 32);
     * radio.writeFast(&buf, 32);
     * radio.writeFast(&buf, 32);   //Fills the FIFO buffers up
     * bool ok = radio.txStandBy(); //Returns 0 if failed. 1 if success.
     *                              //Blocks only until MAX_RT timeout or success. Data flushed on fail.
     * @endcode
     * @see txStandBy(uint32_t timeout, bool startTx)
     * @return
     * - `true` if all payloads in the TX FIFO were delivered successfully and
     *   an acknowledgement (ACK packet) was received for each. If auto-ack is
     *   disabled, then any attempt to transmit will also return true (even if
     *   the payload was not received).
     * - `false` if a payload was sent but was not acknowledged with an ACK
     *   packet. This condition can only be reported if the auto-ack feature
     *   is on.
     */
    bool txStandBy();

    /**
     * This function allows extended blocking and auto-retries per a user defined timeout
     *
     * Fully Blocking Example:
     * @code
     * radio.writeFast(&buf, 32);
     * radio.writeFast(&buf, 32);
     * radio.writeFast(&buf, 32);       //Fills the FIFO buffers up
     * bool ok = radio.txStandBy(1000); //Returns 0 if failed after 1 second of retries. 1 if success.
     *                                  //Blocks only until user defined timeout or success. Data flushed on fail.
     * @endcode
     * @note If used from within an interrupt, the interrupt should be disabled until completion, and sei(); called to enable millis().
     * @param timeout Number of milliseconds to retry failed payloads
     * @param startTx If this is set to `true`, then this function puts the nRF24L01
     * in TX Mode. `false` leaves the primary mode (TX or RX) as it is, which can
     * prevent the mandatory wait time to change modes.
     * @return
     * - `true` if all payloads in the TX FIFO were delivered successfully and
     *   an acknowledgement (ACK packet) was received for each. If auto-ack is
     *   disabled, then any attempt to transmit will also return true (even if
     *   the payload was not received).
     * - `false` if a payload was sent but was not acknowledged with an ACK
     *   packet. This condition can only be reported if the auto-ack feature
     *   is on.
     */
    bool txStandBy(uint32_t timeout, bool startTx = 0);

    /**
     * Write an acknowledgement (ACK) payload for the specified pipe
     *
     * The next time a message is received on a specified `pipe`, the data in
     * `buf` will be sent back in the ACK payload.
     *
     * @see
     * - enableAckPayload()
     * - enableDynamicPayloads()
     *
     * @note ACK payloads are handled automatically by the radio chip when a
     * regular payload is received. It is important to discard regular payloads
     * in the TX FIFO (using flush_tx()) before loading the first ACK payload
     * into the TX FIFO. This function can be called before and after calling
     * startListening().
     *
     * @warning Only three of these can be pending at any time as there are
     * only 3 FIFO buffers. Dynamic payloads must be enabled.
     *
     * @note ACK payloads are dynamic payloads. Calling enableAckPayload()
     * will automatically enable dynamic payloads on pipe 0 (required for TX
     * mode when expecting ACK payloads) & pipe 1. To use ACK payloads on any other
     * pipe in RX mode, call enableDynamicPayloads().
     *
     * @param pipe Which pipe# (typically 1-5) will get this response.
     * @param buf Pointer to data that is sent
     * @param len Length of the data to send, up to 32 bytes max.  Not affected
     * by the static payload size set by setPayloadSize().
     *
     * @note The `len` parameter must be omitted when using the python
     * wrapper because the length of the payload is determined automatically.
     * To use this function in the python wrapper:
     * @code{.py}
     * # let `radio` be the instantiated RF24 object
     * buffer = b"Hello World"  # a `bytes` object
     * radio.writeAckPayload(1, buffer)  # load an ACK payload for response on pipe 1
     * @endcode
     *
     * @return
     * - `true` if the payload was loaded into the TX FIFO.
     * - `false` if the payload wasn't loaded into the TX FIFO because it is
     *   already full or the ACK payload feature is not enabled using
     *   enableAckPayload().
     */
    bool writeAckPayload(uint8_t pipe, const void* buf, uint8_t len);

    /**
     * Clear the Status flags that caused an interrupt event.
     *
     * @remark This function is similar to `whatHappened()` because it also returns the
     * Status flags that caused the interrupt event. However, this function returns
     * a STATUS byte instead of bit-banging into 3 1-byte booleans
     * passed by reference.
     *
     * @note When used in an ISR (Interrupt Service routine), there is a chance that the
     * returned bits 0b1110 (rx_pipe number) is inaccurate. See available(uint8_t*) (or the
     * datasheet) for more detail.
     *
     * @param flags The IRQ flags to clear. Default value is all of them (`RF24_IRQ_ALL`).
     * Multiple flags can be cleared by OR-ing rf24_irq_flags_e values together.
     *
     * @returns The STATUS byte from the radio's register before it was modified. Use
     * enumerations of rf24_irq_flags_e as masks to interpret the STATUS byte's meaning(s).
     *
     * @ingroup StatusFlags
     */
    uint8_t clearStatusFlags(uint8_t flags = RF24_IRQ_ALL);

    /**
     * Set which flags shall be reflected on the radio's IRQ pin.
     *
     * @remarks This function is similar to maskIRQ() but with less confusing parameters.
     *
     * @param flags A value of rf24_irq_flags_e to influence the radio's IRQ pin.
     * The default value (`RF24_IRQ_NONE`) will disable the radio's IRQ pin.
     * Multiple events can be enabled by OR-ing rf24_irq_flags_e values together.
     * ```cpp
     * radio.setStatusFlags(RF24_IRQ_ALL);
     * // is equivalent to
     * radio.setStatusFlags(RF24_RX_DR | RF24_TX_DS | RF24_TX_DF);
     * ```
     *
     * @ingroup StatusFlags
     */
    void setStatusFlags(uint8_t flags = RF24_IRQ_NONE);

    /**
     * Get the latest STATUS byte returned from the last SPI transaction.
     *
     * @note This does not actually perform any SPI transaction with the radio.
     * Use `RF24::update()` instead to get a fresh copy of the Status flags at
     * the slight cost of performance.
     *
     * @returns The STATUS byte from the radio's register as the latest SPI transaction. Use
     * enumerations of rf24_irq_flags_e as masks to interpret the STATUS byte's meaning(s).
     *
     * @ingroup StatusFlags
     */
    uint8_t getStatusFlags();

    /**
     * Get an updated STATUS byte from the radio.
     *
     * @returns The STATUS byte fetched from the radio's register. Use enumerations of
     * rf24_irq_flags_e as masks to interpret the STATUS byte's meaning(s).
     *
     * @ingroup StatusFlags
     */
    uint8_t update();

