LJY7723/esp32yk/1.ControllerSystem/build/sketch/libraries/RF24/RF24.h
    /**
     * Transmission of constant carrier wave with defined frequency and output power
     *
     * @param level Output power to use
     * @param channel The channel to use
     *
     * @warning If isPVariant() returns true, then this function takes extra
     * measures that alter some settings. These settings alterations include:
     * - setAutoAck() to false (for all pipes)
     * - setRetries() to retry `0` times with a delay of 250 microseconds
     * - set the TX address to 5 bytes of `0xFF`
     * - flush_tx()
     * - load a 32 byte payload of `0xFF` into the TX FIFO's top level
     * - disableCRC()
     */
    void startConstCarrier(rf24_pa_dbm_e level, uint8_t channel);

    /**
     * Stop transmission of constant wave and reset PLL and CONT registers
     *
     * @warning this function will powerDown() the radio per recommendation of
     * datasheet.
     * @note If isPVariant() returns true, please remember to re-configure the radio's settings
     * @code
     * // re-establish default settings
     * setCRCLength(RF24_CRC_16);
     * setAutoAck(true);
     * setRetries(5, 15);
     * @endcode
     * @see startConstCarrier()
     */
    void stopConstCarrier(void);

    /**
     * @brief Open or close all data pipes.
     *
     * This function does not alter the addresses assigned to pipes. It is simply a
     * convenience function that allows controlling all pipes at once.
     * @param isEnabled `true` opens all pipes; `false` closes all pipes.
     */
    void toggleAllPipes(bool isEnabled);

    /**
     * @brief configure the RF_SETUP register in 1 transaction
     * @param level This parameter is the same input as setPALevel()'s `level` parameter.
     * See @ref rf24_pa_dbm_e enum for accepted values.
     * @param speed This parameter is the same input as setDataRate()'s `speed` parameter.
     * See @ref rf24_datarate_e enum for accepted values.
     * @param lnaEnable This optional parameter is the same as setPALevel()'s `lnaEnable`
     * optional parameter. Defaults to `true` (meaning LNA feature is enabled) when not specified.
     */
    void setRadiation(uint8_t level, rf24_datarate_e speed, bool lnaEnable = true);

    /**@}*/
    /**
     * @name Deprecated
     *
     *  Methods provided for backwards compatibility.
     */
    /**@{*/

    /**
     * Open a pipe for reading
     * @deprecated For compatibility with old code only, see newer function
     * openReadingPipe().
     * See our [migration guide](migration.md) to understand what you should update in your code.
     *
     * @note Pipes 1-5 should share the first 32 bits.
     * Only the least significant byte should be unique, e.g.
     * @code
     * openReadingPipe(1, 0xF0F0F0F0AA);
     * openReadingPipe(2, 0xF0F0F0F066);
     * @endcode
     *
     * @warning
     * @parblock
     * Pipe 0 is also used by the writing pipe so should typically be avoided as a reading pipe.
     * If used, the reading pipe 0 address needs to be restored at every call to startListening().
     *
     * See http://maniacalbits.blogspot.com/2013/04/rf24-addressing-nrf24l01-radios-require.html
     * @endparblock
     *
     * @param number Which pipe# to open, 0-5.
     * @param address The 40-bit address of the pipe to open.
     */
    void openReadingPipe(uint8_t number, uint64_t address);

    /**
     * Open a pipe for writing
     * @deprecated For compatibility with old code only, see newer function
     * openWritingPipe().
     * See our [migration guide](migration.md) to understand what you should update in your code.
     *
     * Addresses are 40-bit hex values, e.g.:
     *
     * @code
     * openWritingPipe(0xF0F0F0F0F0);
     * @endcode
     *
     * @param address The 40-bit address of the pipe to open.
     */
    void openWritingPipe(uint64_t address);

    /**
     * Determine if an ack payload was received in the most recent call to
     * write(). The regular available() can also be used.
     *
     * @deprecated For compatibility with old code only, see synonymous function available().
     * Use read() to retrieve the ack payload and getDynamicPayloadSize() to get the ACK payload size.
     * See our [migration guide](migration.md) to understand what you should update in your code.
     *
     * @return True if an ack payload is available.
     */
    bool isAckPayloadAvailable(void);

    /**
     * This function is used to configure what events will trigger the Interrupt
     * Request (IRQ) pin active LOW.
     *
     * @deprecated Use setStatusFlags() instead.
     * See our [migration guide](migration.md) to understand what you should update in your code.
     *
     * The following events can be configured:
     * 1. "data sent": This does not mean that the data transmitted was
     * received, only that the attempt to send it was complete.
     * 2. "data failed": This means the data being sent was not received. This
     * event is only triggered when the auto-ack feature is enabled.
     * 3. "data received": This means that data from a receiving payload has
     * been loaded into the RX FIFO buffers. Remember that there are only 3
     * levels available in the RX FIFO buffers.
     *
     * By default, all events are configured to trigger the IRQ pin active LOW.
     * When the IRQ pin is active, use clearStatusFlags() or getStatusFlags() to
     * determine what events triggered it.
     * Remember that calling clearStatusFlags() also clears these
     * events' status, and the IRQ pin will then be reset to inactive HIGH.
     *
     * The following code configures the IRQ pin to only reflect the "data received"
     * event:
     * @code
     * radio.maskIRQ(1, 1, 0);
     * @endcode
     *
     * @param tx_ok  `true` ignores the "data sent" event, `false` reflects the
     * "data sent" event on the IRQ pin.
     * @param tx_fail  `true` ignores the "data failed" event, `false` reflects the
     * "data failed" event on the IRQ pin.
     * @param rx_ready `true` ignores the "data received" event, `false` reflects the
     * "data received" event on the IRQ pin.
     */
    void maskIRQ(bool tx_ok, bool tx_fail, bool rx_ready);

    /**
     * Call this when you get an Interrupt Request (IRQ) to find out why
     *
     * This function describes what event triggered the IRQ pin to go active
     * LOW and clears the status of all events.
     *
     * @deprecated Use clearStatusFlags() instead.
     * See our [migration guide](migration.md) to understand what you should update in your code.
     *
     * @see setStatusFlags()
     *
     * @param[out] tx_ok The transmission attempt completed (TX_DS). This does
     * not imply that the transmitted data was received by another radio, rather
     * this only reports if the attempt to send was completed. This will
     * always be `true` when the auto-ack feature is disabled.
     * @param[out] tx_fail The transmission failed to be acknowledged, meaning
     * too many retries (MAX_RT) were made while expecting an ACK packet. This
     * event is only triggered when auto-ack feature is enabled.
     * @param[out] rx_ready There is a newly received payload (RX_DR) saved to
     * RX FIFO buffers. Remember that the RX FIFO can only hold up to 3
     * payloads. Once the RX FIFO is full, all further received transmissions
     * are rejected until there is space to save new data in the RX FIFO
     * buffers.
     *
     * @note This function expects no parameters in the python wrapper.
     * Instead, this function returns a 3 item tuple describing the IRQ
     * events' status. To use this function in the python wrapper:
     * @code{.py}
     * # let`radio` be the instantiated RF24 object
     * tx_ds, tx_df, rx_dr = radio.whatHappened()  # get IRQ status flags
     * print("tx_ds: {}, tx_df: {}, rx_dr: {}".format(tx_ds, tx_df, rx_dr))
     * @endcode
     */
    void whatHappened(bool& tx_ok, bool& tx_fail, bool& rx_ready);

    /**
     * Similar to startListening(void) but changes the TX address.
     *
     * @deprecated Use stopListening(const uint8_t*) instead.
     * See our [migration guide](migration.md) to understand what you should update in your code.
     *
     * @param txAddress The new TX address.
     * This value will be cached for auto-ack purposes.
     */
    void stopListening(const uint64_t txAddress);

