LJY7723/esp32yk/1.ControllerSystem/build/sketch/libraries/RF24/RF24.h
private:
    /**@}*/
    /**
     * @name Low-level internal interface.
     *
     *  Protected methods that address the chip directly.  Regular users cannot
     *  ever call these.  They are documented for completeness and for developers who
     *  may want to extend this class.
     */
    /**@{*/

    /**
     * initializing function specific to all constructors
     * (regardless of constructor parameters)
     */
    void _init_obj();

    /**
     * initialize radio by performing a soft reset.
     * @warning This function assumes the SPI bus object's begin() method has been
     * previously called.
     */
    bool _init_radio();

    /**
     * initialize the GPIO pins
     */
    bool _init_pins();

    /**
     * Set chip select pin
     *
     * Running SPI bus at PI_CLOCK_DIV2 so we don't waste time transferring data
     * and best of all, we make use of the radio's FIFO buffers. A lower speed
     * means we're less likely to effectively leverage our FIFOs and pay a higher
     * AVR runtime cost as toll.
     *
     * @param mode HIGH to take this unit off the SPI bus, LOW to put it on
     */
    void csn(bool mode);

    /**
     * Write a chunk of data to a register
     *
     * @param reg Which register. Use constants from nRF24L01.h
     * @param buf Where to get the data
     * @param len How many bytes of data to transfer
     * @return Nothing. Older versions of this function returned the status
     * byte, but that it now saved to a private member on all SPI transactions.
     */
    void write_register(uint8_t reg, const uint8_t* buf, uint8_t len);

    /**
     * Write a single byte to a register
     *
     * @param reg Which register. Use constants from nRF24L01.h
     * @param value The new value to write
     * @return Nothing. Older versions of this function returned the status
     * byte, but that it now saved to a private member on all SPI transactions.
     */
    void write_register(uint8_t reg, uint8_t value);

    /**
     * Write the transmit payload
     *
     * The size of data written is the fixed payload size, see getPayloadSize()
     *
     * @param buf Where to get the data
     * @param len Number of bytes to be sent
     * @param writeType Specify if individual payload should be acknowledged
     * @return Nothing. Older versions of this function returned the status
     * byte, but that it now saved to a private member on all SPI transactions.
     */
    void write_payload(const void* buf, uint8_t len, const uint8_t writeType);

    /**
     * Read the receive payload
     *
     * The size of data read is the fixed payload size, see getPayloadSize()
     *
     * @param buf Where to put the data
     * @param len Maximum number of bytes to read
     * @return Nothing. Older versions of this function returned the status
     * byte, but that it now saved to a private member on all SPI transactions.
     */
    void read_payload(void* buf, uint8_t len);

#if !defined(MINIMAL)

    /**
     * Decode and print the given 'observe_tx' value to stdout
     *
     * @param value The observe_tx value to print
     *
     * @warning Does nothing if stdout is not defined.  See fdevopen in stdio.h
     */
    void print_observe_tx(uint8_t value);

    /**
     * Print the name and value of an 8-bit register to stdout
     *
     * Optionally it can print some quantity of successive
     * registers on the same line.  This is useful for printing a group
     * of related registers on one line.
     *
     * @param name Name of the register
     * @param reg Which register. Use constants from nRF24L01.h
     * @param qty How many successive registers to print
     */
    void print_byte_register(const char* name, uint8_t reg, uint8_t qty = 1);

    /**
     * Print the name and value of a 40-bit address register to stdout
     *
     * Optionally it can print some quantity of successive
     * registers on the same line.  This is useful for printing a group
     * of related registers on one line.
     *
     * @param name Name of the register
     * @param reg Which register. Use constants from nRF24L01.h
     * @param qty How many successive registers to print
     */
    void print_address_register(const char* name, uint8_t reg, uint8_t qty = 1);

    /**
     * Put the value of a 40-bit address register into a char array
     *
     * Optionally it can print some quantity of successive
     * registers on the same line.  This is useful for printing a group
     * of related registers on one line.
     *
     * @param out_buffer Output buffer, char array
     * @param reg Which register. Use constants from nRF24L01.h
     * @param qty How many successive registers to print
     * @return The total number of characters written to the given buffer.
     */
    uint8_t sprintf_address_register(char* out_buffer, uint8_t reg, uint8_t qty = 1);
#endif

    /**
     * Turn on or off the special features of the chip
     *
     * The chip has certain 'features' which are only available when the 'features'
     * are enabled.  See the datasheet for details.
     */
    void toggle_features(void);

#if defined(FAILURE_HANDLING) || defined(RF24_LINUX)

    void errNotify(void);

#endif

    /**
     * @brief Manipulate the @ref Datarate and txDelay
     *
     * This is a helper function to setRadiation() and setDataRate()
     * @param speed The desired data rate.
     */
    inline uint8_t _data_rate_reg_value(rf24_datarate_e speed);

    /**
     * @brief Manipulate the @ref PALevel
     *
     * This is a helper function to setRadiation() and setPALevel()
     * @param level The desired @ref PALevel.
     * @param lnaEnable Toggle the LNA feature.
     */
    inline uint8_t _pa_level_reg_value(uint8_t level, bool lnaEnable);

    /**@}*/
};

/**
 * @example{lineno} examples/GettingStarted/GettingStarted.ino
 * Written by [2bndy5](http://github.com/2bndy5) in 2020
 *
 * A simple example of sending data from 1 nRF24L01 transceiver to another.
 *
 * This example was written to be used on 2 devices acting as "nodes".
 * Use the Serial Monitor to change each node's behavior.
 */

/**
 * @example{lineno} examples/AcknowledgementPayloads/AcknowledgementPayloads.ino
 * Written by [2bndy5](http://github.com/2bndy5) in 2020
 *
 * A simple example of sending data from 1 nRF24L01 transceiver to another
 * with Acknowledgement (ACK) payloads attached to ACK packets.
 *
 * This example was written to be used on 2 devices acting as "nodes".
 * Use the Serial Monitor to change each node's behavior.
 */

/**
 * @example{lineno} examples/ManualAcknowledgements/ManualAcknowledgements.ino
 * Written by [2bndy5](http://github.com/2bndy5) in 2020
 *
 * A simple example of sending data from 1 nRF24L01 transceiver to another
 * with manually transmitted (non-automatic) Acknowledgement (ACK) payloads.
 * This example still uses ACK packets, but they have no payloads. Instead the
 * acknowledging response is sent with `write()`. This tactic allows for more
 * updated acknowledgement payload data, where actual ACK payloads' data are
 * outdated by 1 transmission because they have to loaded before receiving a
 * transmission.
 *
 * This example was written to be used on 2 devices acting as "nodes".
 * Use the Serial Monitor to change each node's behavior.
 */

/**
 * @example{lineno} examples/StreamingData/StreamingData.ino
 * Written by [2bndy5](http://github.com/2bndy5) in 2020
 *
 * A simple example of streaming data from 1 nRF24L01 transceiver to another.
 *
 * This example was written to be used on 2 devices acting as "nodes".
 * Use the Serial Monitor to change each node's behavior.
 */

/**
 * @example{lineno} examples/MulticeiverDemo/MulticeiverDemo.ino
 * Written by [2bndy5](http://github.com/2bndy5) in 2020
 *
 * A simple example of sending data from as many as 6 nRF24L01 transceivers to
 * 1 receiving transceiver. This technique is trademarked by
 * Nordic Semiconductors as "MultiCeiver".
 *
 * This example was written to be used on up to 6 devices acting as TX nodes &
 * only 1 device acting as the RX node (that's a maximum of 7 devices).
 * Use the Serial Monitor to change each node's behavior.
 */

/**
 * @example{lineno} examples/InterruptConfigure/InterruptConfigure.ino
 * Written by [2bndy5](http://github.com/2bndy5) in 2020
 *
 * This example uses Acknowledgement (ACK) payloads attached to ACK packets to
 * demonstrate how the nRF24L01's IRQ (Interrupt Request) pin can be
 * configured to detect when data is received, or when data has transmitted
 * successfully, or when data has failed to transmit.
 *
 * This example was written to be used on 2 devices acting as "nodes".
 * Use the Serial Monitor to change each node's behavior.
 */

/**
 * @example{lineno} examples/old_backups/GettingStarted_HandlingFailures/GettingStarted_HandlingFailures.ino
 * Written by [TMRh20](http://github.com/TMRh20) in 2019
 *
 * This example demonstrates the basic getting started functionality, but with
 * failure handling for the radio chip. Addresses random radio failures etc,
 * potentially due to loose wiring on breadboards etc.
 */

/**
 * @example{lineno} examples/old_backups/TransferTimeouts/TransferTimeouts.ino
 * Written by [TMRh20](https://github.com/TMRh20)
 *
 * This example demonstrates the use of and extended timeout period and
 * auto-retries/auto-reUse to increase reliability in noisy or low signal scenarios.
 *
 * Write this sketch to two different nodes.  Put one of the nodes into 'transmit'
 * mode by connecting with the serial monitor and sending a 'T'.  The data <br>
 * transfer will begin, with the receiver displaying the payload count and the
 * data transfer rate.
 */

/**
 * @example{lineno} examples/old_backups/pingpair_irq/pingpair_irq.ino
 * Updated by [TMRh20](https://github.com/TMRh20)
 *
 * This is an example of how to user interrupts to interact with the radio, and a demonstration
 * of how to use them to sleep when receiving, and not miss any payloads.<br>
 * The pingpair_sleepy example expands on sleep functionality with a timed sleep option for the transmitter.
 * Sleep functionality is built directly into my fork of the RF24Network library<br>
 */

/**
 * @example{lineno} examples/old_backups/pingpair_sleepy/pingpair_sleepy.ino
 * Updated by [TMRh20](https://github.com/TMRh20)
 *
 * This is an example of how to use the RF24 class to create a battery-
 * efficient system.  It is just like the GettingStarted_CallResponse example, but the<br>
 * ping node powers down the radio and sleeps the MCU after every
 * ping/pong cycle, and the receiver sleeps between payloads. <br>
 */

/**
 * @example{lineno} examples/rf24_ATTiny/rf24ping85/rf24ping85.ino
 * <b>2014 Contribution by [tong67](https://github.com/tong67)</b><br>
 * Updated 2020 by [2bndy5](http://github.com/2bndy5) for the
 * [SpenceKonde ATTinyCore](https://github.com/SpenceKonde/ATTinyCore)<br>
 * The RF24 library uses the [ATTinyCore by
 * SpenceKonde](https://github.com/SpenceKonde/ATTinyCore)
 *
 * This sketch is a duplicate of the ManualAcknowledgements.ino example
 * (without all the Serial input/output code), and it demonstrates
 * a ATTiny25/45/85 or ATTiny24/44/84 driving the nRF24L01 transceiver using
 * the RF24 class to communicate with another node.
 *
 * A simple example of sending data from 1 nRF24L01 transceiver to another
 * with manually transmitted (non-automatic) Acknowledgement (ACK) payloads.
 * This example still uses ACK packets, but they have no payloads. Instead the
 * acknowledging response is sent with `write()`. This tactic allows for more
 * updated acknowledgement payload data, where actual ACK payloads' data are
 * outdated by 1 transmission because they have to loaded before receiving a
 * transmission.
 *
 * This example was written to be used on 2 devices acting as "nodes".
 */

/**
 * @example{lineno} examples/rf24_ATTiny/timingSearch3pin/timingSearch3pin.ino
 * <b>2014 Contribution by [tong67](https://github.com/tong67)</b><br>
 * Updated 2020 by [2bndy5](http://github.com/2bndy5) for the
 * [SpenceKonde ATTinyCore](https://github.com/SpenceKonde/ATTinyCore)<br>
 * The RF24 library uses the [ATTinyCore by
 * SpenceKonde](https://github.com/SpenceKonde/ATTinyCore)
 *
 * This sketch can be used to determine the best settle time values to use for
 * RF24::csDelay in RF24::csn() (private function).
 * @see RF24::csDelay
 *
 * The settle time values used here are 100/20. However, these values depend
 * on the actual used RC combination and voltage drop by LED. The
 * intermediate results are written to TX (PB3, pin 2 -- using Serial).
 *
 * For schematic details, see introductory comment block in the rf24ping85.ino sketch.
 */

/**
 * @example{lineno} examples/old_backups/pingpair_dyn/pingpair_dyn.ino
 *
 * This is an example of how to use payloads of a varying (dynamic) size on Arduino.
 */

/**
 * @example{lineno} examples_linux/getting_started.py
 * Written by [2bndy5](http://github.com/2bndy5) in 2020
 *
 * This is a simple example of using the RF24 class on a Raspberry Pi.
 *
 * Remember to install the [Python wrapper](python_wrapper.md), then
 * navigate to the "RF24/examples_linux" folder.
 * <br>To run this example, enter
 * @code{.sh}python3 getting_started.py @endcode and follow the prompts.
 *
 * @note this example requires python v3.7 or newer because it measures
 * transmission time with `time.monotonic_ns()`.
 */

/**
 * @example{lineno} examples_linux/acknowledgement_payloads.py
 * Written by [2bndy5](http://github.com/2bndy5) in 2020
 *
 * This is a simple example of using the RF24 class on a Raspberry Pi to
 * transmit and retrieve custom automatic acknowledgment payloads.
 *
 * Remember to install the [Python wrapper](python_wrapper.md), then
 * navigate to the "RF24/examples_linux" folder.
 * <br>To run this example, enter
 * @code{.sh}python3 acknowledgement_payloads.py @endcode and follow the prompts.
 *
 * @note this example requires python v3.7 or newer because it measures
 * transmission time with `time.monotonic_ns()`.
 */

/**
 * @example{lineno} examples_linux/manual_acknowledgements.py
 * Written by [2bndy5](http://github.com/2bndy5) in 2020
 *
 * This is a simple example of using the RF24 class on a Raspberry Pi to
 * transmit and respond with acknowledgment (ACK) transmissions. Notice that
 * the auto-ack feature is enabled, but this example doesn't use automatic ACK
 * payloads because automatic ACK payloads' data will always be outdated by 1
 * transmission. Instead, this example uses a call and response paradigm.
 *
 * Remember to install the [Python wrapper](python_wrapper.md), then
 * navigate to the "RF24/examples_linux" folder.
 * <br>To run this example, enter
 * @code{.sh}python3 manual_acknowledgements.py @endcode and follow the prompts.
 *
 * @note this example requires python v3.7 or newer because it measures
 * transmission time with `time.monotonic_ns()`.
 */

/**
 * @example{lineno} examples_linux/streaming_data.py
 * Written by [2bndy5](http://github.com/2bndy5) in 2020
 *
 * This is a simple example of using the RF24 class on a Raspberry Pi for
 * streaming multiple payloads.
 *
 * Remember to install the [Python wrapper](python_wrapper.md), then
 * navigate to the "RF24/examples_linux" folder.
 * <br>To run this example, enter
 * @code{.sh}python3 streaming_data.py @endcode and follow the prompts.
 *
 * @note this example requires python v3.7 or newer because it measures
 * transmission time with `time.monotonic_ns()`.
 */

/**
 * @example{lineno} examples_linux/interrupt_configure.py
 * Written by [2bndy5](http://github.com/2bndy5) in 2020
 *
 * This is a simple example of using the RF24 class on a Raspberry Pi to
 * detecting (and verifying) the IRQ (interrupt) pin on the nRF24L01.
 *
 * Remember to install the [Python wrapper](python_wrapper.md), then
 * navigate to the "RF24/examples_linux" folder.
 * <br>To run this example, enter
 * @code{.sh}python3 interrupt_configure.py @endcode and follow the prompts.
 *
 * @note this example requires python v3.7 or newer because it measures
 * transmission time with `time.monotonic_ns()`.
 */

/**
 * @example{lineno} examples_linux/multiceiver_demo.py
 * Written by [2bndy5](http://github.com/2bndy5) in 2020
 *
 * This is a simple example of using the RF24 class on a Raspberry Pi for
 * using 1 nRF24L01 to receive data from up to 6 other transceivers. This
 * technique is called "multiceiver" in the datasheet.
 *
 * Remember to install the [Python wrapper](python_wrapper.md), then
 * navigate to the "RF24/examples_linux" folder.
 * <br>To run this example, enter
 * @code{.sh}python3 multiceiver_demo.py @endcode and follow the prompts.
 *
 * @note this example requires python v3.7 or newer because it measures
 * transmission time with `time.monotonic_ns()`.
 */

/**
 * @example{lineno} examples_linux/scanner.cpp
 *
 * Example to detect interference on the various channels available.
 * This is a good diagnostic tool to check whether you're picking a
 * good channel for your application.
 *
 * Inspired by cpixip.
 * See http://arduino.cc/forum/index.php/topic,54795.0.html
 *
 * Use ctrl+C to exit
 */

/**
 * @example{lineno} examples/scanner/scanner.ino
 *
 * Example to detect interference on the various channels available.
 * This is a good diagnostic tool to check whether you're picking a
 * good channel for your application.
 *
 * Inspired by cpixip.
 * See http://arduino.cc/forum/index.php/topic,54795.0.html
 */

/**
 * @example{lineno} examples_linux/gettingstarted.cpp
 * Written by [2bndy5](http://github.com/2bndy5) in 2020
 *
 * A simple example of sending data from 1 nRF24L01 transceiver to another.
 *
 * This example was written  * This example was written to be used on up to 6 devices acting as TX nodes &
 * only 1 device acting as the RX node (that's a maximum of 7 devices).
 acting as "nodes".
 * Use `ctrl+c` to quit at any time.
 */

/**
 * @example{lineno} examples_linux/acknowledgementPayloads.cpp
 * Written by [2bndy5](http://github.com/2bndy5) in 2020
 *
 * A simple example of sending data from 1 nRF24L01 transceiver to another
 * with Acknowledgement (ACK) payloads attached to ACK packets.
 *
 * This example was written to be used on 2 devices acting as "nodes".
 * Use `ctrl+c` to quit at any time.
 */

/**
 * @example{lineno} examples_linux/manualAcknowledgements.cpp
 * Written by [2bndy5](http://github.com/2bndy5) in 2020
 *
 * A simple example of sending data from 1 nRF24L01 transceiver to another
 * with manually transmitted (non-automatic) Acknowledgement (ACK) payloads.
 * This example still uses ACK packets, but they have no payloads. Instead the
 * acknowledging response is sent with `write()`. This tactic allows for more
 * updated acknowledgement payload data, where actual ACK payloads' data are
 * outdated by 1 transmission because they have to loaded before receiving a
 * transmission.
 *
 * This example was written to be used on 2 devices acting as "nodes".
 * Use `ctrl+c` to quit at any time.
 */

/**
 * @example{lineno} examples_linux/streamingData.cpp
 * Written by [2bndy5](http://github.com/2bndy5) in 2020
 *
 * A simple example of sending data from 1 nRF24L01 transceiver to another.
 *
 * This example was written to be used on 2 devices acting as "nodes".
 * Use `ctrl+c` to quit at any time.
 */

/**
 * @example{lineno} examples_linux/multiceiverDemo.cpp
 * Written by [2bndy5](http://github.com/2bndy5) in 2020
 *
 * A simple example of sending data from as many as 6 nRF24L01 transceivers to
 * 1 receiving transceiver. This technique is trademarked by
 * Nordic Semiconductors as "MultiCeiver".
 *
 * This example was written to be used on up to 6 devices acting as TX nodes &
 * only 1 device acting as the RX node (that's a maximum of 7 devices).
 * Use `ctrl+c` to quit at any time.
 */

#endif // RF24_H_
